app/Models/Produit.php

    public function getAllProduits()
    {
        return $this->findAll();
---
SELECT *
FROM `produit`